org_file/lisp/regex-cl-ppcre.org
#+TITLE: 正则表达式之 CL-PPCRE
#+AUTHOR: Leon Yang
#+EMAIL: yjg.2016@gmail.com
#+OPTIONS: email:t ^:{}

* 前言
最近在用 CL-PPCRE 库写正则表达式时，发现很多地方不清楚，不太会用，然后花了点时间复习了正则表达式，并研究了 CL-PPCRE api 的一些不明白的地方，在此写下，作为笔记，也希望能帮助他人。

* 何为 CL-PPCRE
CL-PPCRE 是一个用 Common Lisp 语言写的正则表达式库，下面为[[http://weitz.de/cl-ppcre/][官方文挡]]的介绍：
#+BEGIN_QUOTE
CL-PPCRE is a portable regular expression library for Common Lisp which has the following features:

+ It is *compatible with Perl*.
+ It is pretty *fast*.
+ It is *portable* between ANSI-compliant Common Lisp implementations.
+ It is *thread-safe*.
+ In addition to specifying regular expressions as strings like in Perl you can also use S-expressions.
+ It comes with a [[http://www.opensource.org/licenses/bsd-license.php][BSD-style license]] so you can basically do with it whatever you want.
CL-PPCRE has been used successfully in various applications like BioBike, clutu, LoGS, CafeSpot, Eboy, or The Regex Coach.
#+END_QUOTE

* Scanning

** [Method] create-scanner
*create-scanner* (parse-tree t)&key case-insensitive-mode multi-line-mode single-line-mode extended-mode destructive => scanner, register-names

传递正则表达式（此方法中为 parse-tree），返回用此正则表达式浏览字符串的闭包。第二个返回值只有在*ALLOW-NAMED-REGISTERS*为 t 时返回，默认为 nil。

参数：
+ case-insensitive-mode - 忽略大小写
+ multi-line-mode - 其中 ^ 和 $ 匹配每行的开头和末尾（不是输入字符串的开头和末尾）
+ single-line-mode - 更改.的含义，使它与每一个字符匹配（非单行模式 “.” 是不匹配换行符 \n 的）
+ extended-mode - 表达式中的空白“ ” 和“#”后面的字符会忽略，让正则表达式更加易读
+ destructive - The destructive keyword will be ignored.

parse-tree 为 S-表达式。下面为 parse-tree 与字符串对应关系（可用 parse-string 来看）：
#+BEGIN_VERSE
:VOID - ""
:EVERYTHING - .
:WORD-BOUNDARY :NON-WORD-BOUNDARY - \b \B
:DIGIT-CLASS :NON-DIGIT-CLASS - \d \D
:WORD-CHAR-CLASS :NON-WORD-CHAR-CLASS - \w \W
:WHITESPACE-CHAR-CLASS :NON-WHITESPACE-CHAR-CLASS - \s \ S
:START-ANCHOR :END-ANCHOR - ^ $ （会受 multi-line-mode 影响）
:MODELESS-START-ANCHOR :MODELESS-END-ANCHOR :MODELESS-END-ANCHOR-NO-NEWLINE - \A \Z \z （不受 multi-line-mode 影响）

:CASE-INSENSITIVE-P :CASE-SENSITIVE-P :MULTI-LINE-MODE-P :NOT-MULTI-LINE-MODE-P :SINGLE-LINE-MODE-P :NOT-SINGLE-LINE-MODE-P - "(?i)", "(?-i)", "(?m)", "(?-m)", "(?s)", and "(?-s)"
如：匹配 "abcd"，其中 "bc" 忽略大小写，可以这样写 "a(?:(?i)bc)d"。(?:) 下面提
(parse-string "a(?:(?i)bc)d") ==> (:SEQUENCE #\a (:GROUP (:SEQUENCE (:FLAGS :CASE-INSENSITIVE-P) "bc")) #\d)

:GROUP - (?:) 非捕获组。如果捕获组捕获到内容会把数据返回，非捕获组不会
(:BRANCH <test> <parse-tree>) - (?(<condition>)<yes-pattern>|<no-pattern>) 其中 test 可以是反向数字引用或者零宽断言
(:POSITIVE-LOOKAHEAD|:NEGATIVE-LOOKAHEAD|:POSITIVE-LOOKBEHIND|:NEGATIVE-LOOKBEHIND <parse-tree>) - (?=) (?!) (?<=) (?<!) 零宽断言

(:GREEDY-REPETITION|:NON-GREEDY-REPETITION <min> <max> <parse-tree>) - 默认为贪婪模式，在 *,+,?,{} 等后加 "?" 为非贪婪模式
(:STANDALONE <parse-tree>) - (?>) 不考虑回溯。grab all you can, and do not give anything back。(?>a*)ab 将不会匹配任何字符串，因为(?>a*) 已经把所有的 #\a 匹配了。而a*ab 则会匹配到字符串，因为 a* 会受后面的 ab 影响。

(:REGISTER <parse-tree>) (:NAMED-REGISTER <name> <parse-tree>) - () (?<name> <regex>) 捕获组与命名捕获组。命名捕获组当变量*allow-named-registers*为 t 时才管用。
(:BACK-REFERENCE <ref>) - \number \k<name> 反向引用

(:PROPERTY|:INVERTED-PROPERTY <property>) (:FILTER <function> &optional <length>) - 这两个稍微高端一些，可以定义函数，目前没怎么用到，如果以后用到再更新下吧。

(:CHAR-CLASS|:INVERTED-CHAR-CLASS {<item>}*) - [] [^]

#+END_VERSE

** [Generic Function] scan
*scan* regex target-string &key start end => match-start, match-end, reg-starts, reg-ends

regex 这个参数可以是字符串，也可以是 scanner。如果你传递的是字符串也会调用 create-scanner 方法，通过传递的字符串创建 scanner，所以如果一个正则表达式字符串要被调用多次，还是先创建 scanner 更有效率（后面的函数，方法或宏的 regex 参数一样）

返回值 match-start, match-end, reg-starts, reg-ends 分别是匹配开始索引，结束索引，捕获组开始索引列表，结束索引列表

