_posts/lisp/2016-03-19-regex-cl-ppcre.html
---
layout: post
title: 正则表达式之 CL-PPCRE
category: lisp
description: 正则表达式一些模式用法和 CL-PPCRE 库的使用
---

<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>正则表达式之 CL-PPCRE</title>
<!-- 2016-03-25 Fri 22:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Leon Yang" />
</head>
<body>
<div id="content">
<h1 class="title">正则表达式之 CL-PPCRE</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 前言</a></li>
<li><a href="#sec-2">2. 何为 CL-PPCRE</a></li>
<li><a href="#sec-3">3. Scanning</a>
<ul>
<li><a href="#sec-3-1">3.1. [Method] create-scanner</a></li>
<li><a href="#sec-3-2">3.2. [Generic Function] scan</a></li>
<li><a href="#sec-3-3">3.3. [Function] scan-to-strings</a></li>
<li><a href="#sec-3-4">3.4. [Macro] register-groups-bind</a></li>
<li><a href="#sec-3-5">3.5. 迭代</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Splitting and replacing</a>
<ul>
<li><a href="#sec-4-1">4.1. [Function] split</a></li>
<li><a href="#sec-4-2">4.2. [Function] regex-replace</a></li>
<li><a href="#sec-4-3">4.3. [Function] regex-replace-all</a></li>
</ul>
</li>
<li><a href="#sec-5">5. 总结</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
最近在用 CL-PPCRE 库写正则表达式时，发现很多地方不清楚，不太会用，然后花了点时间复习了正则表达式，并研究了 CL-PPCRE api 的一些不明白的地方，在此写下，作为笔记，也希望能帮助他人。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 何为 CL-PPCRE</h2>
<div class="outline-text-2" id="text-2">
<p>
CL-PPCRE 是一个用 Common Lisp 语言写的正则表达式库，下面为<a href="http://weitz.de/cl-ppcre/">官方文挡</a>的介绍：
</p>
<blockquote>
<p>
CL-PPCRE is a portable regular expression library for Common Lisp which has the following features:
</p>

<ul class="org-ul">
<li>It is <b>compatible with Perl</b>.
</li>
<li>It is pretty <b>fast</b>.
</li>
<li>It is <b>portable</b> between ANSI-compliant Common Lisp implementations.
</li>
<li>It is <b>thread-safe</b>.
</li>
<li>In addition to specifying regular expressions as strings like in Perl you can also use S-expressions.
</li>
<li>It comes with a <a href="http://www.opensource.org/licenses/bsd-license.php">BSD-style license</a> so you can basically do with it whatever you want.
</li>
</ul>
<p>
CL-PPCRE has been used successfully in various applications like BioBike, clutu, LoGS, CafeSpot, Eboy, or The Regex Coach.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Scanning</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> [Method] create-scanner</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<b>create-scanner</b> (parse-tree t)&amp;key case-insensitive-mode multi-line-mode single-line-mode extended-mode destructive =&gt; scanner, register-names
</p>

<p>
传递正则表达式（此方法中为 parse-tree），返回用此正则表达式浏览字符串的闭包。第二个返回值只有在*ALLOW-NAMED-REGISTERS*为 t 时返回，默认为 nil。
</p>

<p>
参数：
</p>
<ul class="org-ul">
<li>case-insensitive-mode - 忽略大小写
</li>
<li>multi-line-mode - 其中 ^ 和 $ 匹配每行的开头和末尾（不是输入字符串的开头和末尾）
</li>
<li>single-line-mode - 更改.的含义，使它与每一个字符匹配（非单行模式 “.” 是不匹配换行符 \n 的）
</li>
<li>extended-mode - 表达式中的空白“ ” 和“#”后面的字符会忽略，让正则表达式更加易读
</li>
<li>destructive - The destructive keyword will be ignored.
</li>
</ul>

<p>
parse-tree 为 S-表达式。下面为 parse-tree 与字符串对应关系（可用 parse-string 来看）：
</p>
<p class="verse">
:VOID - ""<br  />
:EVERYTHING - .<br  />
:WORD-BOUNDARY :NON-WORD-BOUNDARY - \b \B<br  />
:DIGIT-CLASS :NON-DIGIT-CLASS - \d \D<br  />
:WORD-CHAR-CLASS :NON-WORD-CHAR-CLASS - \w \W<br  />
:WHITESPACE-CHAR-CLASS :NON-WHITESPACE-CHAR-CLASS - \s \ S<br  />
:START-ANCHOR :END-ANCHOR - ^ $ （会受 multi-line-mode 影响）<br  />
:MODELESS-START-ANCHOR :MODELESS-END-ANCHOR :MODELESS-END-ANCHOR-NO-NEWLINE - \A \Z \z （不受 multi-line-mode 影响）<br  />
<br  />
:CASE-INSENSITIVE-P :CASE-SENSITIVE-P :MULTI-LINE-MODE-P :NOT-MULTI-LINE-MODE-P :SINGLE-LINE-MODE-P :NOT-SINGLE-LINE-MODE-P - "(?i)", "(?-i)", "(?m)", "(?-m)", "(?s)", and "(?-s)"<br  />
如：匹配 "abcd"，其中 "bc" 忽略大小写，可以这样写 "a(?:(?i)bc)d"。(?:) 下面提<br  />
(parse-string "a(?:(?i)bc)d") ==&gt; (:SEQUENCE #\a (:GROUP (:SEQUENCE (:FLAGS :CASE-INSENSITIVE-P) "bc")) #\d)<br  />
<br  />
:GROUP - (?:) 非捕获组。如果捕获组捕获到内容会把数据返回，非捕获组不会<br  />
(:BRANCH &lt;test&gt; &lt;parse-tree&gt;) - (?(&lt;condition&gt;)&lt;yes-pattern&gt;|&lt;no-pattern&gt;) 其中 test 可以是反向数字引用或者零宽断言<br  />
(:POSITIVE-LOOKAHEAD|:NEGATIVE-LOOKAHEAD|:POSITIVE-LOOKBEHIND|:NEGATIVE-LOOKBEHIND &lt;parse-tree&gt;) - (?=) (?!) (?&lt;=) (?&lt;!) 零宽断言<br  />
<br  />
(:GREEDY-REPETITION|:NON-GREEDY-REPETITION &lt;min&gt; &lt;max&gt; &lt;parse-tree&gt;) - 默认为贪婪模式，在 *,+,?,{} 等后加 "?" 为非贪婪模式<br  />
(:STANDALONE &lt;parse-tree&gt;) - (?&gt;) 不考虑回溯。grab all you can, and do not give anything back。(?&gt;a*)ab 将不会匹配任何字符串，因为(?&gt;a*) 已经把所有的 #\a 匹配了。而a*ab 则会匹配到字符串，因为 a* 会受后面的 ab 影响。<br  />
<br  />
(:REGISTER &lt;parse-tree&gt;) (:NAMED-REGISTER &lt;name&gt; &lt;parse-tree&gt;) - () (?&lt;name&gt; &lt;regex&gt;) 捕获组与命名捕获组。命名捕获组当变量*allow-named-registers*为 t 时才管用。<br  />
(:BACK-REFERENCE &lt;ref&gt;) - \number \k&lt;name&gt; 反向引用<br  />
<br  />
(:PROPERTY|:INVERTED-PROPERTY &lt;property&gt;) (:FILTER &lt;function&gt; &amp;optional &lt;length&gt;) - 这两个稍微高端一些，可以定义函数，目前没怎么用到，如果以后用到再更新下吧。<br  />
<br  />
(:CHAR-CLASS|:INVERTED-CHAR-CLASS {&lt;item&gt;}*) - [] [^]<br  />
<br  />
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> [Generic Function] scan</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<b>scan</b> regex target-string &amp;key start end =&gt; match-start, match-end, reg-starts, reg-ends
</p>

<p>
regex 这个参数可以是字符串，也可以是 scanner。如果你传递的是字符串也会调用 create-scanner 方法，通过传递的字符串创建 scanner，所以如果一个正则表达式字符串要被调用多次，还是先创建 scanner 更有效率（后面的函数，方法或宏的 regex 参数一样）
</p>

<p>
返回值 match-start, match-end, reg-starts, reg-ends 分别是匹配开始索引，结束索引，捕获组开始索引列表，结束索引列表
</p>
</div>
</div>
