org_file/lisp/regex-cl-ppcre.org
** [Function] scan-to-strings
*scan-to-strings* regex target-string &key start end sharedp => match, regs

这里返回值就从广义函数 scan 中的索引变成了字符串（捕获组索引列表变成字符串列表）

If sharedp is true, the substrings may share structure with target-string. 其实 sharedp 参数会决定用 nsubseq（破坏性函数） 还是 subseq 来根据把 target-string 应用到 scan 后得到的返回值索引从 target-string 解出子序列。所以一般对 target-string 的修改没有影响的情况下，将 sharedp 设置为 t 效率会高一些。下面是 *nsubseq* 和 *scan-to-strings* 源码：
#+BEGIN_SRC lisp -n
  (declaim (inline nsubseq))
  (defun nsubseq (sequence start &optional (end (length sequence)))
    "Returns a subsequence by pointing to location in original sequence."
    (make-array (- end start)
                :element-type (array-element-type sequence)
                :displaced-to sequence
                :displaced-index-offset start))

  (defun scan-to-strings (regex target-string &key (start 0)
                                                   (end (length target-string))
                                                   sharedp)
    "Like SCAN but returns substrings of TARGET-STRING instead of
  positions, i.e. this function returns two values on success: the whole
  match as a string plus an array of substrings (or NILs) corresponding
  to the matched registers.  If SHAREDP is true, the substrings may
  share structure with TARGET-STRING."
    (declare #.*standard-optimize-settings*)
    (multiple-value-bind (match-start match-end reg-starts reg-ends)
        (scan regex target-string :start start :end end)
      (unless match-start
        (return-from scan-to-strings nil))
      (let ((substr-fn (if sharedp #'nsubseq #'subseq)))
        (values (funcall substr-fn
                         target-string match-start match-end)
                (map 'vector
                     (lambda (reg-start reg-end)
                       (if reg-start
                         (funcall substr-fn
                                  target-string reg-start reg-end)
                         nil))
                     reg-starts
                     reg-ends)))))
#+END_SRC

** [Macro] register-groups-bind
*register-groups-bind* var-list (regex target-string &key start end sharedp) declaration* statement* => result*

这个看例子就可以
#+BEGIN_EXAMPLE
> (register-groups-bind (first second third fourth)
      ("((a)|(b)|(c))+" "abababc" :sharedp t)
    (list first second third fourth))
("c" "a" "b" "c")

> (register-groups-bind (nil second third fourth)
      ;; note that we don't bind the first and fifth register group
      ("((a)|(b)|(c))()+" "abababc" :start 6)
    (list second third fourth))
(NIL NIL "c")

> (register-groups-bind (first)
      ("(a|b)+" "accc" :start 1)
    (format t "This will not be printed: ~A" first))
NIL

> (register-groups-bind (fname lname (#'parse-integer date month year))
      ("(\\w+)\\s+(\\w+)\\s+(\\d{1,2})\\.(\\d{1,2})\\.(\\d{4})" "Frank Zappa 21.12.1940")
    (list fname lname (encode-universal-time 0 0 0 date month year 0)))
("Frank" "Zappa" 1292889600)
#+END_EXAMPLE

** 迭代
[Macro] *do-scans* (match-start match-end reg-starts reg-ends regex target-string &optional result-form &key start end) declaration* statement* => result*

[Macro] *do-matches* (match-start match-end regex target-string &optional result-form &key start end) declaration* statement* => result*

[Macro] *do-matches-as-strings* (match-var regex target-string &optional result-form &key start end sharedp) declaration* statement* => result*

[Macro] *do-register-groups* var-list (regex target-string &optional result-form &key start end sharedp) declaration* statement* => result*

[Function] *all-matches* regex target-string &key start end => list

[Function] *all-matches-as-strings* regex target-string &key start end sharedp => list

*do-scans* 与 *do-matches* 基本一样，除了 *do-matches* 忽略了 reg-starts 和 reg-ends 两个绑定，如果不需要用到捕获组数据用 *do-matches* 更简便一些。
* Splitting and replacing
** [Function] split
*split* regex target-string &key start end limit with-registers-p omit-unmatched-p sharedp => list

这个看下例子就明白各个参数的用法了
#+BEGIN_EXAMPLE
> (split "\\s+" "foo   bar baz
frob")
("foo" "bar" "baz" "frob")

> (split "\\s*" "foo bar   baz")
("f" "o" "o" "b" "a" "r" "b" "a" "z")

> (split "(\\s+)" "foo bar   baz")
("foo" "bar" "baz")

> (split "(\\s+)" "foo bar   baz" :with-registers-p t)
("foo" " " "bar" "   " "baz")

> (split "(\\s)(\\s*)" "foo bar   baz" :with-registers-p t)
("foo" " " "" "bar" " " "  " "baz")

> (split "(,)|(;)" "foo,bar;baz" :with-registers-p t)
("foo" "," NIL "bar" NIL ";" "baz")

> (split "(,)|(;)" "foo,bar;baz" :with-registers-p t :omit-unmatched-p t)
("foo" "," "bar" ";" "baz")

> (split ":" "a:b:c:d:e:f:g::")
("a" "b" "c" "d" "e" "f" "g")

> (split ":" "a:b:c:d:e:f:g::" :limit 1)
("a:b:c:d:e:f:g::")

> (split ":" "a:b:c:d:e:f:g::" :limit 2)
("a" "b:c:d:e:f:g::")

> (split ":" "a:b:c:d:e:f:g::" :limit 3)
("a" "b" "c:d:e:f:g::")

> (split ":" "a:b:c:d:e:f:g::" :limit 1000)
("a" "b" "c" "d" "e" "f" "g" "" "")
#+END_EXAMPLE

