_posts/lisp/2016-03-19-regex-cl-ppcre.html

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> [Function] scan-to-strings</h3>
<div class="outline-text-3" id="text-3-3">
<p>
<b>scan-to-strings</b> regex target-string &amp;key start end sharedp =&gt; match, regs
</p>

<p>
这里返回值就从广义函数 scan 中的索引变成了字符串（捕获组索引列表变成字符串列表）
</p>

<p>
If sharedp is true, the substrings may share structure with target-string. 其实 sharedp 参数会决定用 nsubseq（破坏性函数） 还是 subseq 来根据把 target-string 应用到 scan 后得到的返回值索引从 target-string 解出子序列。所以一般对 target-string 的修改没有影响的情况下，将 sharedp 设置为 t 效率会高一些。下面是 <b>nsubseq</b> 和 <b>scan-to-strings</b> 源码：
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span class="linenr"> 1: </span>(<span style="color: #859900; font-weight: bold;">declaim</span> (inline nsubseq))
<span class="linenr"> 2: </span>(<span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">nsubseq</span> (sequence start <span style="color: #b58900;">&amp;optional</span> (end (length sequence)))
<span class="linenr"> 3: </span>  <span style="color: #2aa198;">"Returns a subsequence by pointing to location in original sequence."</span>
<span class="linenr"> 4: </span>  (make-array (- end start)
<span class="linenr"> 5: </span>              <span style="color: #657b83; font-weight: bold;">:element-type</span> (array-element-type sequence)
<span class="linenr"> 6: </span>              <span style="color: #657b83; font-weight: bold;">:displaced-to</span> sequence
<span class="linenr"> 7: </span>              <span style="color: #657b83; font-weight: bold;">:displaced-index-offset</span> start))
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>(<span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">scan-to-strings</span> (regex target-string <span style="color: #b58900;">&amp;key</span> (start 0)
<span class="linenr">10: </span>                                                 (end (length target-string))
<span class="linenr">11: </span>                                                 sharedp)
<span class="linenr">12: </span>  <span style="color: #2aa198;">"Like SCAN but returns substrings of TARGET-STRING instead of</span>
<span class="linenr">13: </span><span style="color: #2aa198;">positions, i.e. this function returns two values on success: the whole</span>
<span class="linenr">14: </span><span style="color: #2aa198;">match as a string plus an array of substrings (or NILs) corresponding</span>
<span class="linenr">15: </span><span style="color: #2aa198;">to the matched registers.  If SHAREDP is true, the substrings may</span>
<span class="linenr">16: </span><span style="color: #2aa198;">share structure with TARGET-STRING."</span>
<span class="linenr">17: </span>  (<span style="color: #859900; font-weight: bold;">declare</span> #.*standard-optimize-settings*)
<span class="linenr">18: </span>  (<span style="color: #859900; font-weight: bold;">multiple-value-bind</span> (match-start match-end reg-starts reg-ends)
<span class="linenr">19: </span>      (scan regex target-string <span style="color: #657b83; font-weight: bold;">:start</span> start <span style="color: #657b83; font-weight: bold;">:end</span> end)
<span class="linenr">20: </span>    (<span style="color: #859900; font-weight: bold;">unless</span> match-start
<span class="linenr">21: </span>      (<span style="color: #859900; font-weight: bold;">return-from</span> scan-to-strings nil))
<span class="linenr">22: </span>    (<span style="color: #859900; font-weight: bold;">let</span> ((substr-fn (<span style="color: #859900; font-weight: bold;">if</span> sharedp #'nsubseq #'subseq)))
<span class="linenr">23: </span>      (values (funcall substr-fn
<span class="linenr">24: </span>                       target-string match-start match-end)
<span class="linenr">25: </span>              (map 'vector
<span class="linenr">26: </span>                   (<span style="color: #859900; font-weight: bold;">lambda</span> (reg-start reg-end)
<span class="linenr">27: </span>                     (<span style="color: #859900; font-weight: bold;">if</span> reg-start
<span class="linenr">28: </span>                       (funcall substr-fn
<span class="linenr">29: </span>                                target-string reg-start reg-end)
<span class="linenr">30: </span>                       nil))
<span class="linenr">31: </span>                   reg-starts
<span class="linenr">32: </span>                   reg-ends)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> [Macro] register-groups-bind</h3>
<div class="outline-text-3" id="text-3-4">
<p>
<b>register-groups-bind</b> var-list (regex target-string &amp;key start end sharedp) declaration* statement* =&gt; result*
</p>

<p>
这个看例子就可以
</p>
<pre class="example">
&gt; (register-groups-bind (first second third fourth)
      ("((a)|(b)|(c))+" "abababc" :sharedp t)
    (list first second third fourth))
("c" "a" "b" "c")

&gt; (register-groups-bind (nil second third fourth)
      ;; note that we don't bind the first and fifth register group
      ("((a)|(b)|(c))()+" "abababc" :start 6)
    (list second third fourth))
(NIL NIL "c")

&gt; (register-groups-bind (first)
      ("(a|b)+" "accc" :start 1)
    (format t "This will not be printed: ~A" first))
NIL

&gt; (register-groups-bind (fname lname (#'parse-integer date month year))
      ("(\\w+)\\s+(\\w+)\\s+(\\d{1,2})\\.(\\d{1,2})\\.(\\d{4})" "Frank Zappa 21.12.1940")
    (list fname lname (encode-universal-time 0 0 0 date month year 0)))
("Frank" "Zappa" 1292889600)
</pre>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> 迭代</h3>
<div class="outline-text-3" id="text-3-5">
<p>
[Macro] <b>do-scans</b> (match-start match-end reg-starts reg-ends regex target-string &amp;optional result-form &amp;key start end) declaration* statement* =&gt; result*
</p>

<p>
[Macro] <b>do-matches</b> (match-start match-end regex target-string &amp;optional result-form &amp;key start end) declaration* statement* =&gt; result*
</p>

<p>
[Macro] <b>do-matches-as-strings</b> (match-var regex target-string &amp;optional result-form &amp;key start end sharedp) declaration* statement* =&gt; result*
</p>

<p>
[Macro] <b>do-register-groups</b> var-list (regex target-string &amp;optional result-form &amp;key start end sharedp) declaration* statement* =&gt; result*
</p>

<p>
[Function] <b>all-matches</b> regex target-string &amp;key start end =&gt; list
</p>

<p>
[Function] <b>all-matches-as-strings</b> regex target-string &amp;key start end sharedp =&gt; list
</p>

<p>
<b>do-scans</b> 与 <b>do-matches</b> 基本一样，除了 <b>do-matches</b> 忽略了 reg-starts 和 reg-ends 两个绑定，如果不需要用到捕获组数据用 <b>do-matches</b> 更简便一些。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Splitting and replacing</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> [Function] split</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<b>split</b> regex target-string &amp;key start end limit with-registers-p omit-unmatched-p sharedp =&gt; list
</p>

<p>
这个看下例子就明白各个参数的用法了
</p>
<pre class="example">
&gt; (split "\\s+" "foo   bar baz
frob")
("foo" "bar" "baz" "frob")

&gt; (split "\\s*" "foo bar   baz")
("f" "o" "o" "b" "a" "r" "b" "a" "z")

&gt; (split "(\\s+)" "foo bar   baz")
("foo" "bar" "baz")

&gt; (split "(\\s+)" "foo bar   baz" :with-registers-p t)
("foo" " " "bar" "   " "baz")

&gt; (split "(\\s)(\\s*)" "foo bar   baz" :with-registers-p t)
("foo" " " "" "bar" " " "  " "baz")

&gt; (split "(,)|(;)" "foo,bar;baz" :with-registers-p t)
("foo" "," NIL "bar" NIL ";" "baz")

&gt; (split "(,)|(;)" "foo,bar;baz" :with-registers-p t :omit-unmatched-p t)
("foo" "," "bar" ";" "baz")

&gt; (split ":" "a:b:c:d:e:f:g::")
("a" "b" "c" "d" "e" "f" "g")

&gt; (split ":" "a:b:c:d:e:f:g::" :limit 1)
("a:b:c:d:e:f:g::")

&gt; (split ":" "a:b:c:d:e:f:g::" :limit 2)
("a" "b:c:d:e:f:g::")

&gt; (split ":" "a:b:c:d:e:f:g::" :limit 3)
("a" "b" "c:d:e:f:g::")

&gt; (split ":" "a:b:c:d:e:f:g::" :limit 1000)
("a" "b" "c" "d" "e" "f" "g" "" "")
</pre>
</div>
</div>
