org_file/lisp/regex-cl-ppcre.org
** [Function] regex-replace
*regex-replace* regex target-string replacement &key start end preserve-case simple-calls element-type => string, matchp

preserve-case 会使 replacement 跟随匹配部分的大小写，看下面例子。

replacement 可以是字符串，字符串中可以包含 "\&" 表示 regex 匹配的部分，"\`" 表示匹配之前的部分，"\'" 表示匹配之后的部分。对应了符号表示 :match, :before-match, or :after-match。也可以用 "\N" 或 "\{N}" 来表示第 N 个匹配组。也可以是一个函数对象（function designator），接受(target-string start end match-start match-end reg-starts reg-ends) 为参数，返回值替换匹配的部分。

simple-calls 如果为 t，replacement 传递的函数对象参数就会变为 match, register-1, ..., register-n。

#+BEGIN_EXAMPLE
> (regex-replace "fo+" "foo bar" "frob")
"frob bar"
T

> (regex-replace "fo+" "FOO bar" "frob")
"FOO bar"
NIL

> (regex-replace "(?i)fo+" "FOO bar" "frob")
"frob bar"
T

> (regex-replace "(?i)fo+" "FOO bar" "frob" :preserve-case t)
"FROB bar"
T

> (regex-replace "(?i)fo+" "Foo bar" "frob" :preserve-case t)
"Frob bar"
T

> (regex-replace "bar" "foo bar baz" "[frob (was '\\&' between '\\`' and '\\'')]")
"foo [frob (was 'bar' between 'foo ' and ' baz')] baz"
T

> (regex-replace "bar" "foo bar baz"
                          '("[frob (was '" :match "' between '" :before-match "' and '" :after-match "')]"))
"foo [frob (was 'bar' between 'foo ' and ' baz')] baz"
T

> (regex-replace "(f)(o)" "fooba" "\\{2}")
"ooba"
T

> (regex-replace "fo" "abfob"
		       #'(lambda (target-string start end match-start match-end reg-starts reg-ends)
			   (format nil "[target-string:~A start:~A end:~A match-start:~A match-end:~A reg-starts:~A reg-ends:~A]"
				   target-string start end match-start match-end reg-starts reg-ends)))
"ab[target-string:abfob start:0 end:5 match-start:2 match-end:4 reg-starts:#() reg-ends:#()]b"
T

> (regex-replace "(be)(nev)(o)(lent)"
                          "benevolent: adj. generous, kind"
                          #'(lambda (match &rest registers)
                              (format nil "~A [~{~A~^.~}]" match registers))
                          :simple-calls t)
"benevolent [be.nev.o.lent]: adj. generous, kind"
T
#+END_EXAMPLE

** [Function] regex-replace-all
*regex-replace-all* regex target-string replacement &key start end preserve-case simple-calls element-type => string, matchp

直接看例子
#+BEGIN_EXAMPLE
> (regex-replace-all "(?i)fo+" "foo Fooo FOOOO bar" "frob" :preserve-case t)
"frob Frob FROB bar"
T

> (regex-replace-all "(?i)f(o+)" "foo Fooo FOOOO bar" "fr\\1b" :preserve-case t)
"froob Frooob FROOOOB bar"
T

> (let ((qp-regex (create-scanner "[\\x80-\\xff]")))
    (defun encode-quoted-printable (string)
      "Converts 8-bit string to quoted-printable representation."
      ;; won't work for Corman Lisp because non-ASCII characters aren't 8-bit there
      (flet ((convert (target-string start end match-start match-end reg-starts reg-ends)
             (declare (ignore start end match-end reg-starts reg-ends))
             (format nil "=~2,'0x" (char-code (char target-string match-start)))))
        (regex-replace-all qp-regex string #'convert))))
Converted ENCODE-QUOTED-PRINTABLE.
ENCODE-QUOTED-PRINTABLE

> (encode-quoted-printable "Fête Sørensen naïve Hühner Straße")
"F=EAte S=F8rensen na=EFve H=FChner Stra=DFe"
T

> (let ((url-regex (create-scanner "[^a-zA-Z0-9_\\-.]")))
    (defun url-encode (string)
      "URL-encodes a string."
      ;; won't work for Corman Lisp because non-ASCII characters aren't 8-bit there
      (flet ((convert (target-string start end match-start match-end reg-starts reg-ends)
             (declare (ignore start end match-end reg-starts reg-ends))
             (format nil "%~2,'0x" (char-code (char target-string match-start)))))
        (regex-replace-all url-regex string #'convert))))
Converted URL-ENCODE.
URL-ENCODE

> (url-encode "Fête Sørensen naïve Hühner Straße")
"F%EAte%20S%F8rensen%20na%EFve%20H%FChner%20Stra%DFe"
T

> (defun how-many (target-string start end match-start match-end reg-starts reg-ends)
    (declare (ignore start end match-start match-end))
    (format nil "~A" (- (svref reg-ends 0)
                        (svref reg-starts 0))))
HOW-MANY

> (regex-replace-all "{(.+?)}"
                              "foo{...}bar{.....}{..}baz{....}frob"
                              (list "[" 'how-many " dots]"))
"foo[3 dots]bar[5 dots][2 dots]baz[4 dots]frob"
T

> (let ((qp-regex (create-scanner "[\\x80-\\xff]")))
    (defun encode-quoted-printable (string)
      "Converts 8-bit string to quoted-printable representation.
Version using SIMPLE-CALLS keyword argument."
      ;; ;; won't work for Corman Lisp because non-ASCII characters aren't 8-bit there
      (flet ((convert (match)
               (format nil "=~2,'0x" (char-code (char match 0)))))
        (regex-replace-all qp-regex string #'convert
                                    :simple-calls t))))

Converted ENCODE-QUOTED-PRINTABLE.
ENCODE-QUOTED-PRINTABLE

> (encode-quoted-printable "Fête Sørensen naïve Hühner Straße")
"F=EAte S=F8rensen na=EFve H=FChner Stra=DFe"
T

> (defun how-many (match first-register)
    (declare (ignore match))
    (format nil "~A" (length first-register)))
HOW-MANY

> (regex-replace-all "{(.+?)}"
                              "foo{...}bar{.....}{..}baz{....}frob"
                              (list "[" 'how-many " dots]")
                              :simple-calls t)

"foo[3 dots]bar[5 dots][2 dots]baz[4 dots]frob"
T
#+END_EXAMPLE

* 总结
有了以上的基础知识，基本可以无障碍使用 CL-PPCRE 库了。还有 CL-PPCRE 的细节没有讲到，如：改变一些变量，可以修改 scanner 的行为。一些其他的函数，宏等。这些可以等到 CL-PPCRE 用的更深入的时候再去研究。
