_posts/lisp/2016-03-19-regex-cl-ppcre.html

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> [Function] regex-replace</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<b>regex-replace</b> regex target-string replacement &amp;key start end preserve-case simple-calls element-type =&gt; string, matchp
</p>

<p>
preserve-case 会使 replacement 跟随匹配部分的大小写，看下面例子。
</p>

<p>
replacement 可以是字符串，字符串中可以包含 "\&amp;" 表示 regex 匹配的部分，"\`" 表示匹配之前的部分，"\'" 表示匹配之后的部分。对应了符号表示 :match, :before-match, or :after-match。也可以用 "\N" 或 "\{N}" 来表示第 N 个匹配组。也可以是一个函数对象（function designator），接受(target-string start end match-start match-end reg-starts reg-ends) 为参数，返回值替换匹配的部分。
</p>

<p>
simple-calls 如果为 t，replacement 传递的函数对象参数就会变为 match, register-1, &#x2026;, register-n。
</p>

<pre class="example">
&gt; (regex-replace "fo+" "foo bar" "frob")
"frob bar"
T

&gt; (regex-replace "fo+" "FOO bar" "frob")
"FOO bar"
NIL

&gt; (regex-replace "(?i)fo+" "FOO bar" "frob")
"frob bar"
T

&gt; (regex-replace "(?i)fo+" "FOO bar" "frob" :preserve-case t)
"FROB bar"
T

&gt; (regex-replace "(?i)fo+" "Foo bar" "frob" :preserve-case t)
"Frob bar"
T

&gt; (regex-replace "bar" "foo bar baz" "[frob (was '\\&amp;' between '\\`' and '\\'')]")
"foo [frob (was 'bar' between 'foo ' and ' baz')] baz"
T

&gt; (regex-replace "bar" "foo bar baz"
                          '("[frob (was '" :match "' between '" :before-match "' and '" :after-match "')]"))
"foo [frob (was 'bar' between 'foo ' and ' baz')] baz"
T

&gt; (regex-replace "(f)(o)" "fooba" "\\{2}")
"ooba"
T

&gt; (regex-replace "fo" "abfob"
		       #'(lambda (target-string start end match-start match-end reg-starts reg-ends)
			   (format nil "[target-string:~A start:~A end:~A match-start:~A match-end:~A reg-starts:~A reg-ends:~A]"
				   target-string start end match-start match-end reg-starts reg-ends)))
"ab[target-string:abfob start:0 end:5 match-start:2 match-end:4 reg-starts:#() reg-ends:#()]b"
T

&gt; (regex-replace "(be)(nev)(o)(lent)"
                          "benevolent: adj. generous, kind"
                          #'(lambda (match &amp;rest registers)
                              (format nil "~A [~{~A~^.~}]" match registers))
                          :simple-calls t)
"benevolent [be.nev.o.lent]: adj. generous, kind"
T
</pre>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> [Function] regex-replace-all</h3>
<div class="outline-text-3" id="text-4-3">
<p>
<b>regex-replace-all</b> regex target-string replacement &amp;key start end preserve-case simple-calls element-type =&gt; string, matchp
</p>

<p>
直接看例子
</p>
<pre class="example">
&gt; (regex-replace-all "(?i)fo+" "foo Fooo FOOOO bar" "frob" :preserve-case t)
"frob Frob FROB bar"
T

&gt; (regex-replace-all "(?i)f(o+)" "foo Fooo FOOOO bar" "fr\\1b" :preserve-case t)
"froob Frooob FROOOOB bar"
T

&gt; (let ((qp-regex (create-scanner "[\\x80-\\xff]")))
    (defun encode-quoted-printable (string)
      "Converts 8-bit string to quoted-printable representation."
      ;; won't work for Corman Lisp because non-ASCII characters aren't 8-bit there
      (flet ((convert (target-string start end match-start match-end reg-starts reg-ends)
             (declare (ignore start end match-end reg-starts reg-ends))
             (format nil "=~2,'0x" (char-code (char target-string match-start)))))
        (regex-replace-all qp-regex string #'convert))))
Converted ENCODE-QUOTED-PRINTABLE.
ENCODE-QUOTED-PRINTABLE

&gt; (encode-quoted-printable "Fête Sørensen naïve Hühner Straße")
"F=EAte S=F8rensen na=EFve H=FChner Stra=DFe"
T

&gt; (let ((url-regex (create-scanner "[^a-zA-Z0-9_\\-.]")))
    (defun url-encode (string)
      "URL-encodes a string."
      ;; won't work for Corman Lisp because non-ASCII characters aren't 8-bit there
      (flet ((convert (target-string start end match-start match-end reg-starts reg-ends)
             (declare (ignore start end match-end reg-starts reg-ends))
             (format nil "%~2,'0x" (char-code (char target-string match-start)))))
        (regex-replace-all url-regex string #'convert))))
Converted URL-ENCODE.
URL-ENCODE

&gt; (url-encode "Fête Sørensen naïve Hühner Straße")
"F%EAte%20S%F8rensen%20na%EFve%20H%FChner%20Stra%DFe"
T

&gt; (defun how-many (target-string start end match-start match-end reg-starts reg-ends)
    (declare (ignore start end match-start match-end))
    (format nil "~A" (- (svref reg-ends 0)
                        (svref reg-starts 0))))
HOW-MANY

&gt; (regex-replace-all "{(.+?)}"
                              "foo{...}bar{.....}{..}baz{....}frob"
                              (list "[" 'how-many " dots]"))
"foo[3 dots]bar[5 dots][2 dots]baz[4 dots]frob"
T

&gt; (let ((qp-regex (create-scanner "[\\x80-\\xff]")))
    (defun encode-quoted-printable (string)
      "Converts 8-bit string to quoted-printable representation.
Version using SIMPLE-CALLS keyword argument."
      ;; ;; won't work for Corman Lisp because non-ASCII characters aren't 8-bit there
      (flet ((convert (match)
               (format nil "=~2,'0x" (char-code (char match 0)))))
        (regex-replace-all qp-regex string #'convert
                                    :simple-calls t))))

Converted ENCODE-QUOTED-PRINTABLE.
ENCODE-QUOTED-PRINTABLE

&gt; (encode-quoted-printable "Fête Sørensen naïve Hühner Straße")
"F=EAte S=F8rensen na=EFve H=FChner Stra=DFe"
T

&gt; (defun how-many (match first-register)
    (declare (ignore match))
    (format nil "~A" (length first-register)))
HOW-MANY

&gt; (regex-replace-all "{(.+?)}"
                              "foo{...}bar{.....}{..}baz{....}frob"
                              (list "[" 'how-many " dots]")
                              :simple-calls t)

"foo[3 dots]bar[5 dots][2 dots]baz[4 dots]frob"
T
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 总结</h2>
<div class="outline-text-2" id="text-5">
<p>
有了以上的基础知识，基本可以无障碍使用 CL-PPCRE 库了。还有 CL-PPCRE 的细节没有讲到，如：改变一些变量，可以修改 scanner 的行为。一些其他的函数，宏等。这些可以等到 CL-PPCRE 用的更深入的时候再去研究。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Leon Yang</p>
<p class="email">Email: <a href="mailto:yjg.2016@gmail.com">yjg.2016@gmail.com</a></p>
<p class="date">Created: 2016-03-25 Fri 22:34</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
